# KeyBasedTreeEntriesLoadResults Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntriesLoadResults Constructor
KeyBasedTreeEntriesLoadResults Class See Also
---
Creates an empty KeyBasedTreeEntriesLoadResults.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeyBasedTreeEntriesLoadResults()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
KeyBasedTreeEntriesLoadResults()
```

# See Also
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace